[
  {
    "parkName": "Bainbridge Island Japanese American Exclusion Memorial National Historic Site",
    "state": "WA",
    "parkType": "NHS",
    "description": "A memorial to the unconstitutional, forced removal and incarceration of 272 Japanese Americans from Bainbridge Island on March 30, 1942 as a result of Executive Order 9066. The memorial was built on the exact path to the Eagledale dock where residents were forced to depart to be sent to concentration camps. 🕊️ ''A large Western Red Cedar that stood near the Eagledale ferry dock as Bainbridge Islanders were forced to leave their homes in 1942 — and that still stands on the site of the Memorial — was added to the National Registry of Historic Trees in 2003 by the American Forests organization. Only the second West Coast tree to earn this distinction, it is considered a living witness to an event that helped shape our nation.'' (quoted from BIJAEMA website) 🕊️ The NPS description of this historic site can be found at: https://www.nps.gov/miin/learn/historyculture/bainbridge-island-japanese-american-exclusion-memorial.htm 🕊️ Although a small government trailer exists on grounds, mail can not be delivered to it. General information inquiries should therefore be addressed to the non-profit organization BIJAEMA instead of the national park service",
    "websiteURL": "https://bijaema.org/",
    "visitorCenterHours": "Hours: 9am – 5pm, 7 days a week, March 1st -- December 1st",
    "streetAddress": "221 Winslow Way West, Suite 206",
    "city": "Bainbridge Island",
    "zipcode": "98110",
    "phone": "360-386-2114",
    "googleMaps": "https://maps.app.goo.gl/TW1HpoQJ9CLwsdMo6"
  },
  {
    "parkName": "Ebey's Landing National Historical Reserve",
    "state": "WA",
    "parkType": "NHR",
    "description": "This park consists of the historic (1850s) Ebey family farm on Whidbey Island with trails thru meadows and woods overlooking views of the Salish Sea and Puget Sound.",
    "websiteURL": "https://www.nps.gov/ebla/",
    "visitorCenterHours": "Visitor Center Hours: 9am - 4pm, Monday-Friday",
    "streetAddress": "PO Box 774",
    "city": "Coupeville",
    "zipcode": "98239",
    "phone": "360-678-6084",
    "googleMaps": "https://maps.app.goo.gl/n52EHDiry3Uc5qCs8"
  },
  {
  "parkName": "Fort Vancouver National Historic Site",
  "state": "WA",
  "parkType": "NHS",
  "description": "Fort Vancouver was a historic frontier fur trading post on the northern bank of the Columbia River. The park includes a reconstructed 1825 fort, civil war era Army officers buildings, and a WW1 era air museum.",
  "websiteURL": "https://www.nps.gov/fova/",
  "visitorCenterHours": "Visitor Center Hours: 9am – 4pm, Tuesday-Saturday",
  "streetAddress": "800 Hatheway Road, Bldg. 722",
  "city": "Vancouver",
  "zipcode": "98661",
  "phone": "360-816-6230",
  "googleMaps": "https://maps.app.goo.gl/fjxrdZcyA4QqN5xS6"
  },
  {
  "parkName": "Klondike Gold Rush National Historical Park",
  "state": "WA",
  "parkType": "NHP",
  "description": "Learn the story of the 1890s Klondike Gold Rush and its role in Seattle's history! The visitor center is located inside the historic Cadillac Hotel at the intersection of Second Avenue and Jackson Street in downtown Seattle. This is the sister park to the Klondike Gold Rush NHP in Skagway, Alaska.",
  "websiteURL": "https://www.nps.gov/klse/",
  "visitorCenterHours": "Visitor Center Hours: 10am - 5pm, Wednesday - Sunday",
  "streetAddress": "319 Second Ave S.",
  "city": "Seattle",
  "zipcode": "98104",
  "phone": "206-220-4240",
  "googleMaps": "https://maps.app.goo.gl/DpUNzW81aazD1jt7A"
  },
  {
  "parkName": "Lake Roosevelt National Recreation Area",
  "state": "WA",
  "parkType": "NRA",
  "description": "This is the largest reservoir (133 miles) in the Pacific Northwest! It is located on the upper Columbia River in NE Washington. The park contains several campgrounds and day-use areas. At the SE end of the lake is Fort Spokane Visitor Center & Museum inside the former guardhouse of historic Fort Spokane. Exhibits include: Ice Age Floods, Military History, and 19th Century Native American Boarding Schools.󠀠󠀠 🌲 At the SW end of the lake is Grand Coulee Dam (operated by the Bureau of Reclamation). The dam was built in the late 1970s. The dam's visitor center features educational exhibits, guided tours, and a nightly laser light show. It also is part of the Ice Age Floods National Geologic Trail. The Bureau of Reclamation visitor center is open year-round: Daily, 8:30am–5pm. Dam website: https://www.usbr.gov/pn/grandcoulee/visit/",
  "websiteURL": "https://www.nps.gov/laro/",
  "visitorCenterHours": "Fort Spokane Hours: 9:30am-5pm, Thursday-Monday, Seasonal: Memorial Day to Labor Day",
  "streetAddress": "1008 Crest Drive",
  "city": "Coulee Dam",
  "zipcode": "991164",
  "phone": "509-754-7800",
  "googleMaps": "https://maps.app.goo.gl/83JF6YTWw6nXQGgW8"
  },
  {
  "parkName": "Lewis & Clark National Historical Park",
  "state": "WA",
  "parkType": "NHP",
  "description": "Within Washington, Clark's Tree, Cape Disappointment, Fort Columbia, Middle Village, and Dismal Nitch are all parts of the Lewis & Clark National Historical Park. They are also part of the Lewis & Clark National Historic Trail, which spans 16 states. 🌲 Quote: ''Standing high on the cliffs at Cape Disappointment State Park, Lewis & Clark Interpretive Center tells the story of the Lewis and Clark Expedition and Chinook tribe, as well as local maritime and military history.'' 🌲 Quote: ''Fort Columbia is situated atop Chinook Point and was built between 1896 and 1903. After being de-commissioned in 1947, this former military installation became a 618-acre Washington State Historical Park. Lewis and Clark passed through this area on January 9th, 1806.''  🌲 Fort Columbia website: www.nps.gov/places/fort-columbia-historical-state-park.htm",
  "websiteURL": "https://parks.wa.gov/find-parks/state-parks/cape-disappointment-state-park/lewis-clark-interpretive-center",
  "visitorCenterHours": "Washington's Lewis & Clark Interpretive Center Hours: 10am-5pm daily from Apr. 1 – Oct. 31 🌲 10am-5pm Wed-Sun from Nov. 1 – Mar. 31",
  "streetAddress": "244 Robert Gray Drive",
  "city": "Ilwaco",
  "zipcode": "98624",
  "phone": "360-642-3029",
  "googleMaps": "https://maps.app.goo.gl/MAWxg5AVT5HicDEk8"
  },
  {
  "parkName": "Manhattan Project National Historical Park",
  "state": "WA",
  "parkType": "NHP",
  "description": "Tours of the Hanford B Reactor (managed by the US Department of Energy) and other historic facilities are available. The nuclear reactors at Hanford produced plutonium for the Manhattan Project to fuel the first atomic bomb test. The Fat Man atomic bomb dropped on Nagasaki, Japan on August 9, 1945. ☢️ General inquiries should be addressed to: Manhattan Project National Historical Park c/o NPS Intermountain Regional Office ☢️ In addition to the Hanford Visitor Center (see hours below and Google Maps link below), there is also the Tri-Cities Visitor Center located at 7130 W. Grandridge Blvd, Suite B in Kennewick, WA 99336, which is open Monday thru Friday from 8AM – 5PM. ☢️ Also, the REACH Museum in Richland has information about the Ice Age Floods National Geologic Trail in addition to information on the Manhattan Project. The REACH Museum hours are 10am-4:30, Tues-Sat.",
  "websiteURL": "https://www.nps.gov/mapr/planyourvisit/hanford-wa.htm",
  "visitorCenterHours": "Hanford Visitor Center Hours: 8AM–4:30PM, Monday thru Saturday",
  "streetAddress": "P.O. Box 25287",
  "city": "Denver, CO",
  "zipcode": "80225",
  "phone": "509-376-1647",
  "googleMaps": "https://maps.app.goo.gl/t9ut5A6UCXmxCca7A"
  },
  {
    "parkName": "Mount Rainier National Park",
    "state": "WA",
    "parkType": "NP",
    "description": "Quote: ''An active volcano, Mount Rainier is the most glaciated peak in the contiguous U.S., spawning 5 major rivers. Subalpine wildflower meadows ring the icy volcano while ancient forest cloaks Mount Rainier’s lower slopes.'' The peak of the volcano is 14,410 feet above sea level. ⛰️ TIMED ENTRY RESERVATIONS MAY BE REQUIRED from May thru September, 7am-5pm. CHECK OFFICIAL NPS WEBSITE FOR THE LATEST INFO (For example, timed entry is paused for the Paradise Corridor in 2025 but STILL ACTIVE for the Sunrise Corridor in 2025). Each corridor requires a separate vehicle reservation. Timed entry reservations are good for a single day, per vehicle, and are required in addition to an entrance fee or park pass.",
    "websiteURL": "https://www.nps.gov/mora/index.htm",
    "visitorCenterHours": "June - Sept, 9am-4:30pm daily @ Longmire Museum at Longmire Wilderness Information Center 🌲🌲 June - Sept, 9:30am-5:30pm daily @ Henry M Jackson Memorial Visitor Center 🌲🌲 June - Sept, 9am-5pm daily @ Ohanapecosh Visitor Center 🌲🌲 July - Sept, 9am-5pm daily @ Sunrise Visitor Center",
    "streetAddress": "55210 238th Avenue East",
    "city": "Ashford",
    "zipcode": "98304",
    "phone": "360-569-6575",
    "googleMaps": "https://maps.app.goo.gl/wqQFRHwadREsi9Zs5"
  },
  {
  "parkName": "Nez Perce - Buffalo Eddy National Historical Park",
  "state": "WA",
  "parkType": "NHP",
  "description": "Quote: ''Since time immemorial, the valleys, prairies, mountains, and plateaus of the inland northwest have been home to the nimíipuu (Nez Perce) people. Extremely resilient, they survived the settling of the United States and adapted to a changed world. Nez Perce National Historical Park consists of 38 places important to the history and culture of the nimíipuu.'' 🪨 Quote: ''The Nez Perce left behind vivid evidence of their association with this land. On either side of an eddy formed by a series of sharp bends in the Snake River, are densely grouped clusters of petroglyphs and pictographs. Known as Buffalo Eddy, the unique petroglyphs contain hundreds of distinct images that possibly date from as early as 4,500 years ago.''",
  "websiteURL": "https://www.nps.gov/nepe/learn/historyculture/buffalo-eddy-history.htm",
  "visitorCenterHours": "There is no visitor center in Washington for this site. Only interpretive signs exist. The nearest Nez Perce visitor center is 34 miles away in Idaho.",
  "streetAddress": "39063 US Hwy 95",
  "city": "Lapwai, ID",
  "zipcode": "83540",
  "phone": "208-843-7001",
  "googleMaps": "https://maps.app.goo.gl/SwqveSCAsydSXto79"
  },
  {
  "parkName": "North Cascades National Park",
  "state": "WA",
  "parkType": "NP",
  "description": "Explore an alpine landscape that contains over 300 glaciers and one of the largest ranges of biodiversity of any national park in the U.S.! Most of the park is designated as wilderness, and exploring its remote, mountainous content can be dangerous for inexperienced hikers and rock climbers.  There are no entrance fees, but there also is almost no road access and permits are required year round for overnight stays in almost all of the park.",
  "websiteURL": "https://www.nps.gov/noca/index.htm",
  "visitorCenterHours": "Visitor Center Hours: 9am-5pm every day during Summer.",
  "streetAddress": "810 State Route 20",
  "city": "Sedro-Woolley",
  "zipcode": "98284",
  "phone": "360-854-7200",
  "googleMaps": "https://maps.app.goo.gl/bUZUiRp2SUB2c78c7"
  },
  {
  "parkName": "Olympic National Park",
  "state": "WA",
  "parkType": "NP",
  "description": "This park combines glaciated mountains, oceanside views, and a temperate rainforest!  It is designated as both a World Heritage Site and an International Biosphere Reserve by the United Nations!  Many plant and animal species are found only here and nowhere else on Earth!  Although the main park visitor center is open almost every day of the year, the Hoh Rain Forest center is only open during the summer (9am-5pm), requires driving over 30 miles away from the nearest amenities, and often becomes congested with stand-still traffic jams on weekends.",
  "websiteURL": "https://www.nps.gov/olym/index.htm",
  "visitorCenterHours": "Port Angeles Visitor Center: Open year-round. 9 am - 5 pm in Summer; 9 am - 4 pm the rest of the year.",
  "streetAddress": "600 E. Park Avenue",
  "city": "Port Angeles",
  "zipcode": "98362",
  "phone": "360-565-3130",
  "googleMaps": "https://maps.app.goo.gl/pdG356uvkDfNADdS7"
  },
  {
  "parkName": "San Juan Island National Historical Park",
  "state": "WA",
  "parkType": "NHP",
  "description": "Since it is located on an island, travel to this national park is limited to only visitors who arrive by boat or air. Historically, ownership of the island was divided between the U.S. and Great Britian, and the two countries almost went to war over it in 1859. Educational historical reinactments often take place during the summer and there are over 23 miles of trails inside the park. Animal viewing highlights include the Island Marble Butterfly (previously feared extinct), whales, black colored red foxes, and several popular bird species.",
  "websiteURL": "https://www.nps.gov/sajh/index.htm",
  "visitorCenterHours": "During the summer, both the American Camp Visitor Center and English Camp Visitor Center are open Thurs - Tues from 10AM - 3PM.",
  "streetAddress": "P.O. Box 429",
  "city": "Friday Harbor",
  "zipcode": "98250",
  "phone": "360-378-2240",
  "googleMaps": "https://maps.app.goo.gl/mExSgTRw1EZF7cEp7"
  },
  {
  "parkName": "Whitman Mission National Historic Site",
  "state": "WA",
  "parkType": "NHS",
  "description": "This site commemorates an important Presbyterian missionary stop on the Oregon Trail.  A deadly measles outbreak in 1847 led Native Americans to murder 13 of the white settlers, take another 47 of them hostage, and sparked the 8 year long Cayuse War with the U.S.",
  "websiteURL": "https://www.nps.gov/whmi/index.htm",
  "visitorCenterHours": "Visitor Center Hours: Tuesday-Saturday from 9am–4pm",
  "streetAddress": "328 Whitman Mission Road",
  "city": "Walla Walla",
  "zipcode": "99362",
  "phone": "509-522-6360",
  "googleMaps": "https://maps.app.goo.gl/pRKrXLiZuYdUoCDWA"
  }
]