[
  {
    "parkName": "Bainbridge Island Japanese American Exclusion Memorial National Historic Site",
    "state": "WA",
    "parkType": "NHS",
    "description": "A memorial to the unconstitutional, forced removal and incarceration of 272 Japanese Americans from Bainbridge Island on March 30, 1942 as a result of Executive Order 9066. The memorial was built on the exact path to the Eagledale dock where residents were forced to depart to be sent to concentration camps. 🕊️ ''A large Western Red Cedar that stood near the Eagledale ferry dock as Bainbridge Islanders were forced to leave their homes in 1942 — and that still stands on the site of the Memorial — was added to the National Registry of Historic Trees in 2003 by the American Forests organization. Only the second West Coast tree to earn this distinction, it is considered a living witness to an event that helped shape our nation.'' (quoted from BIJAEMA website) 🕊️ The NPS description of this historic site can be found at: https://www.nps.gov/miin/learn/historyculture/bainbridge-island-japanese-american-exclusion-memorial.htm 🕊️ Although a small government trailer exists on grounds, mail can not be delivered to it. General information inquiries should therefore be addressed to the non-profit organization BIJAEMA instead of the national park service",
    "websiteURL": "https://bijaema.org/",
    "visitorCenterHours": "Hours: 9am – 5pm, 7 days a week, March 1st -- December 1st",
    "streetAddress": "221 Winslow Way West, Suite 206",
    "city": "Bainbridge Island",
    "zipcode": "98110",
    "phone": "360-386-2114",
    "googleMaps": "https://maps.app.goo.gl/TW1HpoQJ9CLwsdMo6"
  },
  {
    "parkName": "Ebey's Landing National Historical Reserve",
    "state": "WA",
    "parkType": "NHR",
    "description": "This park consists of the historic (1850s) Ebey family farm on Whidbey Island with trails thru meadows and woods overlooking views of the Salish Sea and Puget Sound.",
    "websiteURL": "https://www.nps.gov/ebla/",
    "visitorCenterHours": "Visitor Center Hours: 9am - 4pm, Monday-Friday",
    "streetAddress": "PO Box 774",
    "city": "Coupeville",
    "zipcode": "98239",
    "phone": "360-678-6084",
    "googleMaps": "https://maps.app.goo.gl/n52EHDiry3Uc5qCs8"
},
{
  "parkName": "Mount Rainier National Park",
  "state": "WA",
  "parkType": "NP",
  "description": "An active volcano, Mount Rainier is the most glaciated peak in the contiguous U.S., spawning 5 major rivers. Subalpine wildflower meadows ring the icy volcano while ancient forest cloaks Mount Rainier’s lower slopes. The peak is 14,410 feet above sea level. ⛰️ TIMED ENTRY, RESERVATIONS MAY BE REQUIRED from May thru September, 7am-5pm. CHECK OFFICIAL NPS WEBSITE FOR THE LATEST UPDATE (For example, timed entry is paused for the Paradise Corridor in 2025 but STILL ACTIVE for the Sunrise Corridor in 2025). Each corridor requires a separate vehicle reservation. Timed entry reservations are good for a single day, per vehicle, and are required in addition to an entrance fee or park pass.",
  "websiteURL": "https://www.nps.gov/mora/index.htm",
  "visitorCenterHours": "June - Sept, 9am-4:30pm daily @ Longmire Museum at Longmire Wilderness Information Center 🌲🌲 June - Sept, 9:30am-5:30pm daily @ Henry M Jackson Memorial Visitor Center 🌲🌲 June - Sept, 9am-5pm daily @ Ohanapecosh Visitor Center 🌲🌲 July - Sept, 9am-5pm daily @ Sunrise Visitor Center",
  "streetAddress": "55210 238th Avenue East",
  "city": "Ashford",
  "zipcode": "98304",
  "phone": "360-569-6575",
  "googleMaps": "https://www.google.com/maps/place/Henry+M.+Jackson+Memorial+Visitor+Center/@46.7858833,-121.7367888,573m/data=!3m2!1e3!4b1!4m6!3m5!1s0x5490d36ca0f016ad:0x1da35e56b2c70bb3!8m2!3d46.7858833!4d-121.7367888!16s%2Fm%2F0464t9z"
}]